modules/old_configs/emacs/config.el
    (general-evil-setup)
    ;; set 'SPC' as global leader key
    (general-create-definer lm/leader-keys
      :states '(normal insert visual emacs)
      :keymaps 'override
      :prefix "SPC" ;; set leader
      :global-prefix "M-SPC") ;; access leader in insert mode

    (lm/leader-keys
        "b" '(:ignore t :wk "buffer")
        "b b" '(switch-to-buffer :wk "Switch buffer")
        "b i" '(ibuffer :wk "Ibuffer")
        "b k" '(kill-this-buffer :wk "Kill this buffer")
        "b n" '(next-buffer :wk "Next buffer")
        "b p" '(previous-buffer :wk "Previous buffer")
        "b r" '(revert-buffer :wk "Reload buffer"))

    (lm/leader-keys
        "e" '(:ignore t :wk "Eshell/Evaluate")
        "e b" '(eval-buffer :wk "Evaluate elisp in buffer")
        "e d" '(eval-defun :wk "Evaluate defun containing or after point")
        "e e" '(eval-expression :wk "Evaluate an elisp expression")
        "e l" '(eval-last-sexp :wk "Evaluate elisp expression before point")
        "e r" '(eval-region :wk "Evaluate elisp in region")
        "e h" '(counsel-esh-history :wk "Eshell history")
        "e s" '(eshell :wk "Eshell"))

    (lm/leader-keys
        "SPC" '(counsel-M-x :wk "Counsel M-x")
        "." '(find-file :wk "Find file")
        "f c" '((lambda () (interactive) (find-file "~/.config/emacs/config.org")) :wk "Edit emacs config")
        "f r" '(counsel-recentf :wk "Find recent files")
        "TAB TAB" '(comment-line :wk "Comment lines"))

    (lm/leader-keys
        "h" '(:ignore t :wk "Help")
        "h f" '(describe-function :wk "Describe function")
        "h v" '(describe-variable :wk "Describe variable")
        "h r r" '(reload-init-file :wk "Reload emacs config"))
        ;; "h r r" '((lambda () (interactive) (load-file user-init-file)) :wk "Reload emacs config"))

    (lm/leader-keys
        "i" '(:ignore t :wk "Insert")
        "i p" '(org-download-screenshot :wk "Insert screenshot (org)"))

    (lm/leader-keys
        "t" '(:ignore t :wk "Toggle")
        "t l" '(display-line-numbers-mode :wk "Toggle line numbers")
        "t v" '(vterm-toggle :wk "Toggle Vterm")
        "t i" '(org-toggle-inline-images :wk "Toggle inline images")
        "t t" '(visual-line-mode :wk "Toggle truncated lines"))

    (lm/leader-keys
        "s" '(:ignore t :wk "Shell")
        "s c" '(shell-command :wk "Run a shell command")
        "s d" '(sh-cd-here :wk "Move current shell to current dir")
        "s m" '(sh-mode :wk "Shell mode"))

    (lm/leader-keys
        "c" '(:ignore t :wk "Capitalize")
        "c w" '(capitalize-word :wk "Capitalize word")
        "c r" '(capitalize-region :wk "Capitalize region")
        "c c" '(upcase-char :wk "Upcase char")
        "c u" '(upcase-region :wk "Upcase region"))

    (lm/leader-keys
        "l" '(:ignore t :wk "Downcase")
        "l w" '(downcase-word :wk "Downcase word")
        "l u" '(downcase-region :wk "Downcase region"))

    ;; Evil window bindings
    (lm/leader-keys
        "w" '(:ignore t :wk "Window")
        "w w" '(evil-window-next :wk "Next window")
        "w h" '(evil-window-left :wk "Move cursor to window left")
        "w j" '(evil-window-down :wk "Move cursor to window below")
        "w k" '(evil-window-up :wk "Move cursor to window above")
        "w l" '(evil-window-right :wk "Move cursor to window right")
        "w s" '(evil-window-split :wk "Split window horizontally")
        "w v" '(evil-window-vsplit :wk "Split window vertically")
        "w H" '(evil-window-move-far-left :wk "Move split to left")
        "w J" '(evil-window-move-very-bottom :wk "Move split to bottom")
        "w K" '(evil-window-move-very-top :wk "Move split to top")
        "w L" '(evil-window-move-far-right :wk "Move split to right")
        "w c" '(evil-window-delete :wk "Close window")
        "w o" '(delete-other-windows :wk "__")
        "w =" '(balance-windows :wk "__")
        "q k" '(kill-buffer-and-window :wk "Kill buf and window")
        "q q" '(save-buffers-kill-terminal :wk "Save bufs, kill term"))

    ;; (evil-global-set-key 'visual "K" (kbd ":m '<-2 RET gv '< gk")) 
    (evil-global-set-key 'visual "K" 'drag-stuff-up) 
    ;; (evil-global-set-key 'visual "J" (kbd ":m '>+1 RET gv '> gj")) 
    (evil-global-set-key 'visual "J" 'drag-stuff-down)

    (lm/leader-keys
       "p" '(:ignore t :wk "Project")
       "p o" '(dashboard-open :wk "Return to dashboard")
       "p f" '(project-find-file :wk "Find project file"))

)

(use-package all-the-icons
    :ensure t
    :diminish
    :if (display-graphic-p))
(use-package all-the-icons-dired
    :hook (dired-mode . (lambda () (all-the-icons-dired-mode t))))

(setq backup-directory-alist
      `((".*" . "~/emacs/auto-saves")))
(setq auto-save-file-name-transforms
      `((".*" "~/emacs/auto-saves" t)))

(use-package company
  :defer 2
  :diminish
  :custom
  (company-begin-commands '(self-insert-command))
  (company-idle-delay .1)
  (company-minimum-prefix-length 2)
  (company-show-numbers t)
  (company-tooltip-align-annotations 't)
  (global-company-mode t))

(use-package company-box
  :after company
  :diminish
  :hook (company-mode . company-box-mode))

(use-package dashboard
      :ensure t
      :diminish
      :init
      (setq initial-buffer-choice 'dashboard-open)
      (setq dashboard-set-heading-icons t)
      ;; (setq dashboard-set-navigator t)
      (setq dashboard-set-file-icons t)
      (setq dashboard-banner-logo-title "Welcome to Emacs!")
      ;; (setq dashboard-startup-banner 'logo) ;; default logo
      (setq dashboard-startup-banner "~/pictures/smol-penguin.png")
      (setq dashboard-center-content t)
      (setq dashboard-items '((recents . 5)
                              (agenda . 5)
                              (bookmarks . 3)
                              ;; (registers . 3)
                              (projects . 3)))
;; (dashboard-modify-heading-icons '((recents . "file-text")
                                  ;; (bookmarks . "book")))  
      :config
      (dashboard-setup-startup-hook))

(use-package diminish)

(use-package drag-stuff
    :diminish
    :config
(drag-stuff-global-mode 1))

(use-package flycheck
  :ensure t
  :defer t
  :diminish
  :init (global-flycheck-mode))
