modules/old_configs/emacs/config.org
** Setting The Font Face

#+begin_src emacs-lisp

    (set-face-attribute 'default nil
  ;; try switch to Source Code Pro
      :font "FiraCodeNerdFontMono"
      :height 110
      :weight 'medium)
    (set-face-attribute 'variable-pitch nil
      :font "FiraCodeNerdFontMono"
      :height 120
      :weight 'medium)
    (set-face-attribute 'fixed-pitch nil
      :font "FiraCodeNerdFontMono"
      :height 110
      :weight 'medium)
    ;; Makes commented text and keywords italics.
    ;; This is working in emacsclient but not emacs.
    ;; Your font must have an italic face available.
    (set-face-attribute 'font-lock-comment-face nil
      :slant 'italic)
    (set-face-attribute 'font-lock-keyword-face nil
      :slant 'italic)

    ;; This sets the default font on all graphical frames created after restarting Emacs.
    ;; Does the same thing as 'set-face-attribute default' above, but emacsclient fonts
    ;; are not right unless I also add this method of setting the default font.
    (add-to-list 'default-frame-alist '(font . "FiraCodeNerdFontMono-14"))

    ;; Uncomment the following line if line spacing needs adjusting.
    ;; (setq-default line-spacing 0.12)

#+end_src

** Zoom In/Out
Enable zoom in/out with C-=/- and also for C-scrl-up/down
#+begin_src emacs-lisp
(global-set-key (kbd "C-=") 'text-scale-increase) 
(global-set-key (kbd "C--") 'text-scale-decrease)
(global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
(global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)
#+end_src

* GNUPLOT
#+begin_src emacs-lisp
  (use-package gnuplot-mode)
  ;; automatically open files ending with .gp or .gnuplot in gnuplot mode
  ;; (setq auto-mode-alist 
  ;; (append '(("\\.\\(gp\\|gnuplot\\)$" . gnuplot-mode)) auto-mode-alist)))

#+end_src

* IMAGE DIR-ED
#+begin_src emacs-lisp
  (use-package image-dired+)
#+end_src
* INDENTING/TABS
#+begin_src emacs-lisp
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 4)
  (setq-default indent-line-function 'insert-tab)
  (setq-default c-default-style "linux"
                c-basic-offset 4)
 ;; if indent-tabs-mode is off, untabify before saving
 ;;(add-hook 'write-file-hooks 
 ;;         (lambda () (if (not indent-tabs-mode)
 ;;                        (untabify (point-min) (point-max)))))
#+end_src

* LIGATURES
#+begin_src emacs-lisp
   ;; This assumes you've installed the package via MELPA.
   (use-package ligature
     :config
     ;; Enable the "www" ligature in every possible major mode
     (ligature-set-ligatures 't '("www"))
     ;; Enable traditional ligature support in eww-mode, if the
     ;; `variable-pitch' face supports it
     (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
     ;; Enable all FiraMonoNerdFont and Fira Code ligatures in programming modes

     (ligature-set-ligatures 'prog-mode
                         '(;; == === ==== => =| =>>=>=|=>==>> ==< =/=//=// =~
                           ;; =:= =!=
                           ("=" (rx (+ (or ">" "<" "|" "/" "~" ":" "!" "="))))
                           ;; ;; ;;;
                           (";" (rx (+ ";")))
                           ;; && &&&
                           ("&" (rx (+ "&")))
                           ;; !! !!! !. !: !!. != !== !~
                           ("!" (rx (+ (or "=" "!" "\." ":" "~"))))
                           ;; ?? ??? ?:  ?=  ?.
                           ("?" (rx (or ":" "=" "\." (+ "?"))))
                           ;; %% %%%
                           ("%" (rx (+ "%")))
                           ;; |> ||> |||> ||||> |] |} || ||| |-> ||-||
                           ;; |->>-||-<<-| |- |== ||=||
                           ;; |==>>==<<==<=>==//==/=!==:===>
                           ("|" (rx (+ (or ">" "<" "|" "/" ":" "!" "}" "\]"
                                           "-" "=" ))))
                           ;; \\ \\\ \/
                           ("\\" (rx (or "/" (+ "\\"))))
                           ;; ++ +++ ++++ +>
                           ("+" (rx (or ">" (+ "+"))))
                           ;; :: ::: :::: :> :< := :// ::=
                           (":" (rx (or ">" "<" "=" "//" ":=" (+ ":"))))
                           ;; // /// //// /\ /* /> /===:===!=//===>>==>==/
                           ("/" (rx (+ (or ">"  "<" "|" "/" "\\" "\*" ":" "!"
                                           "="))))
                           ;; .. ... .... .= .- .? ..= ..<
                           ("\." (rx (or "=" "-" "\?" "\.=" "\.<" (+ "\."))))
                           ;; -- --- ---- -~ -> ->> -| -|->-->>->--<<-|
                           ("-" (rx (+ (or ">" "<" "|" "~" "-"))))
                           ;; *> */ *)  ** *** ****
                           ("*" (rx (or ">" "/" ")" (+ "*"))))
                           ;; www wwww
                           ("w" (rx (+ "w")))
                           ;; <> <!-- <|> <: <~ <~> <~~ <+ <* <$ </  <+> <*>
                           ;; <$> </> <|  <||  <||| <|||| <- <-| <-<<-|-> <->>
                           ;; <<-> <= <=> <<==<<==>=|=>==/==//=!==:=>
                           ;; << <<< <<<<
                           ("<" (rx (+ (or "\+" "\*" "\$" "<" ">" ":" "~"  "!"
                                           "-"  "/" "|" "="))))
                           ;; >: >- >>- >--|-> >>-|-> >= >== >>== >=|=:=>>
                           ;; >> >>> >>>>
                           (">" (rx (+ (or ">" "<" "|" "/" ":" "=" "-"))))
                           ;; #: #= #! #( #? #[ #{ #_ #_( ## ### #####
                           ("#" (rx (or ":" "=" "!" "(" "\?" "\[" "{" "_(" "_"
                                        (+ "#"))))
                           ;; ~~ ~~~ ~=  ~-  ~@ ~> ~~>
                           ("~" (rx (or ">" "=" "-" "@" "~>" (+ "~"))))
                           ;; __ ___ ____ _|_ __|____|_
                           ("_" (rx (+ (or "_" "|"))))
                           ;; Fira code: 0xFF 0x12
                           ("0" (rx (and "x" (+ (in "A-F" "a-f" "0-9")))))
                           ;; Fira code:
                           "Fl"  "Tl"  "fi"  "fj"  "fl"  "ft"
                           ;; The few not covered by the regexps.
                           "{|"  "[|"  "]#"  "(*"  "}#"  "$>"  "^="))

     ;; Enables ligature checks globally in all buffers. You can also do it
     ;; per mode with `ligature-mode'.
     (global-ligature-mode t))

#+end_src

* MARKDOWN MODE
#+begin_src emacs-lisp
(use-package markdown-mode
  :ensure t
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "multimarkdown"))

#+end_src

* ORG DOWNLOAD
#+begin_src emacs-lisp

    ;; inspired by https://zzamboni.org/post/how-to-insert-screenshots-in-org-documents-on-macos/

  (use-package org-download
    :after org
    :defer nil
    :custom
    (org-download-method 'directory)
    (org-download-image-dir "~/emacs/")
    (org-download-heading-lvl 0)
    (org-download-timestamp "org_%Y%m%d-%H%M%S_")
    ;; (org-image-actual-width 400)
    (org-download-screenshot-method "wl-paste -t image/png > '%s'")
    :bind
    ("C-M-y" . org-download-screenshot)
    :config
    (require 'org-download))
#+end_src

* PULSE
Pulse highlight a line on certain actions

# #+begin_src emacs-lisp
#   (use-package pulse
#     :ensure nil
#     :defer
#     :init
#     (defun pulse-line (&rest _)
#       "Pulse the current line"
#       (pulse-momentary-highlight-one-line (point)))

#     (dolist (command '(scroll-up-command
#                        scroll-down-command
#                        windmove-left
#                        windmove-right
#                        windmove-up
#                        windmove-down
#                        move-to-window-line-top-bottom
#                        recenter-top-bottom
#                        other-window))
#     (advice-add command :after #'pulse-line)))
# #+end_src

# * PROJECTILE
[[https://github.com/bbatsov/projectile][Projectile]] is a project interaction library for Emacs.

#+begin_src emacs-lisp
  (use-package projectile
    :diminish
    :config
    (projectile-mode 1))
#+end_src

* RAINBOW MODE
Display the actual color as a background for any hex color value (ex. #ffffff).  The code block below enables rainbow-mode in all programming modes (prog-mode) as well as org-mode, which is why rainbow works in this document.  

#+begin_src emacs-lisp
  (use-package rainbow-mode
    :diminish
    :hook 
    ((org-mode prog-mode) . rainbow-mode))
#+end_src

* RELOAD EMACS
This is just an example of how to create a simple function in Emacs.  Use this function to reload Emacs after adding changes to the config.  Yes, I am loading the user-init-file twice in this function, which is a hack because for some reason, just loading the user-init-file once does not work properly.

#+begin_src emacs-lisp
  (defun reload-init-file ()
    (interactive)
    (load-file user-init-file)
    (load-file user-init-file))
#+end_src

* SHELLS AND TERMINALS

